export const text = {
    upload: {
        title: 'تحویل گزارش کار',
        subtitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است',
        date: 'موعد انجام',
        btn: 'ثبت تغییرات',

        chart: {
            title: 'گزارش کار‌های تحویل شده',
        },        
    },
    reading: {
        title: 'مطالعه مقالات',
        date: 'موعد انجام',

        chart: {
            title: 'مطالعه مقالات',
        }
    },
}