export const text = {
    title_1: 'دانشجویان فعلی',
    title_2: 'دانشجویان قبلی',

    header_1: 'نام دانشجو',
    header_2: 'زمان',
    header_3: 'اسمارتیز',
    header_4: 'فعالیت های اخیر',

    empty_list: 'هنوز هیچ دانشجویی به آزمایشگاه اضافه نشده است',

    info: 'هر مربع بیانگر آخرین تسک‌هایی است که به دانشجو داده شده، مربع خالی بیانگر این است که ددلاین این تسک هنوز نگذشته است. مربع آبی بیانگر تسکی‌است که در زمان ددلاین خود انجام شده است. مربع‌ نارنجی برای تسک‌ای است که از بعد از اتمام مهلتش انجام شده است و مربع قرمز بیانگر این است که با وجود اینکه مهلت تسک تمام شده، هنوز انجام نشده است. \n در کنار تسک‌ها شما می‌توانید تعداد مربعات قرمز را در یک عدد ببینید.'
}