export const text = {
    title: 'مدیریت فعالیت‌های امتیازی',

    subtitle_1: 'فعالیت‌ها',
    subtitle_2: 'اطلاعات فعالیت جدید',
    subtitle_2_1: 'داوطلبین مجاز',

    text_2_1: 'گروه ها',
    text_2_2: 'نفرات',

    input_1: 'عنوان فعالیت',
    input_2: 'تعداد اسمارتیز دریفاتی',
    input_3: 'نیاز به آپلود فایل',
    input_4: 'توضیحات (اختیاری)',
    input_5: 'مهلت فعالیت:',

    button: 'افزودن',

    mode_1: 'بدون داوطلب',
    mode_2: 'در حال اجرا',
    mode_3: 'انجام شده',

    empty_users_list: 'هنوز هیچ دانشجویی به آزمایشگاه اضافه نشده است',
    empty_groups_list: 'هنوز هیچ گروهی وجود ندارد',
    empty_activities_list: 'چنین فعالیتی هنوز وجود ندارد',
}