export const text = {
    sidebar_item_1: 'ارسال ایمیل جدید',
    sidebar_item_2: 'ایمیل‌های ارسالی',
    sidebar_item_3: 'تنظیمات',
    sidebar_item_4: 'راهنمایی',

    help_text_1: '‌‌در قسمت ”ارسال به“ شما با نوشتن @ و سپس نام گروه مدنظر می‌توانید ایمیل را به تمام اعضای آن گروه ارسال کنید.',
    help_text_2: 'در متن یا عنوان ایمیل شما با نوشتن @ و سپس یکی از موارد زیر می‌توانید از اطلاعات شخصی هر فرد در متن تمپلیت/ایمیل استفاده نمایید.',
    help_text_item_1: 'نام: نام فرد',
    help_text_item_2: 'نام_خانوادگی: نام خانوادگی فرد',
    help_text_item_3: 'نام_کامل: نام و نام خانوادگی فرد',
    help_text_item_4: 'عنوان: عنوان فرد در آزمایشگاه، مثال',
    help_text_item_4_1: 'دانشجوی کارشناسی',
    help_text_item_4_2: 'دانشجوی ارشد',
    help_text_item_4_3: 'دکتری',
    help_text_item_4_4: 'ناظر',

    
}
