import { default as cs } from 'classnames'
import styles from './dashboard.module.scss'
import { text } from './constants';
import ProgressTracker from 'components/progressTracker';
import TaskStatusBar from 'components/dashboardTaskStatus';
import taskIcon from 'assets/icons/clipboard-text.svg'
import { truncateText } from 'utils/mapper';
import Pagination from 'components/global/pagination';



export default function UserDashboard() {

    const title = 'عنوان فاز';
    const tasks = [
        {
            id: '1',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/05/06 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status:'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'وابسته به زمان نیست',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'تاخیر در ارائه',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'وابسته به زمان نیست',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
        {
            id: '2',
            title: 'گزارش',
            status: 'نزدیک مهلت انجام',
            deadline: '1402/06/30 - 16:00',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز',
        },
    ]

    return (
        <div className={cs(styles['container'])}>
            <div className={cs(styles['step_progress_container'])}>
                <h5> {text.t1.title} - {`[${title}]`} </h5>
                <ProgressTracker />
            </div>

            <div className={cs(styles['upcoming_activities_container'])}>
                <div className={cs(styles['title'])}>
                    <div> {text.t2.title} </div>
                    <div> {text.t2.deadline} </div>
                </div>
                <div className={cs(styles['activities'])}>
                    {
                        tasks.map((task, index) => {
                            return (
                                <div className={cs(styles['activity-box'])}>
                                    <div className={cs(styles['activity-data'])}>
                                        <div className={cs(styles['right-column'])}> 
                                            <div className={cs(styles['icon'])}>
                                                <img src={taskIcon} alt='icon'/>
                                            </div>
                                            <p className={cs(styles['activity-title'])}> {task.title} </p>
                                            {task?.status && <TaskStatusBar status={task.status}/>}                                            
                                        </div>

                                        <div className={cs(styles['activity-deadline'])}> {task.deadline} </div>
                                    </div>
                                    <p className={cs(styles['activity-text'])}> {truncateText(task.text, 180)} </p>
                                </div>
                            )
                        })
                    }
                </div>

                <div>
                    <Pagination />
                </div>
            </div>
        </div>

    )
}

