export const text = {
    input_1: 'نام',
    input_2: ' توضیحات (اختیاری) ',

    input_3: ' زمان شروع *',
    input_4: ' زمان پایان *',

    input_5: 'تکرار نشود',
    input_6: 'هر هفته',
    input_7: 'هر ماه',

    input_8: 'تعداد مشخص',
    input_9: 'تا تاریخ مشخص',

    input_10: 'فروم دارد',
    input_11: 'تسک دارد',
    input_12: 'مرا خبر کن',
    input_13: 'آپلود گزارش',
    input_14: 'خواندن مقاله',
    input_15: 'اسمارتیز *',
    input_16: 'انتخاب همه',

    desc_1: '* نام و توضیحات مربوط به تسک ایجاد شده با نام و توضیحات این رویداد یکسان است',
    desc_2: '* برای مشخص کردن تگ های مورد نظر، آن ها را بین دو تا ستاره قرار دهید. \n (مثال: **software development**)',

    title_1: 'تکرار',
    title_2: 'مدت',
    title_3: 'دانشجوها * ',
    title_4: 'نفرات * ',
    title_5: 'گروه ها',


    button: 'ذخیره رویداد',
}