import { useNavigate, useParams } from 'react-router-dom'
import { useEffect } from 'react';
import { default as cs } from 'classnames'
import styles from './forum.module.scss'
import useInput from 'hooks/useInputHandler';
import { useSelector } from 'react-redux';
import { text } from './constants';
import {useRef} from 'react';
import avatar from 'assets/images/avatar.png';
import user1 from 'assets/user3.svg';
import user2 from 'assets/user1.svg';
import user3 from 'assets/user4.svg';
import user4 from 'assets/user2.svg';
import user5 from 'assets/user5.svg';
import user6 from 'assets/user6.svg';
import user7 from 'assets/user7.svg';
import addIcon from 'assets/icons/essential/add/dark-color.svg'
import filterIcon from 'assets/icons/essential/filter/dark-color.svg'
import sortIcon from 'assets/icons/essential/sort/dark-color.svg'
import backArrow from 'assets/icons/arrow/arrow-left/dark-color2.svg'
import send from 'assets/icons/arrow/send/main-color.svg'
import ForumPreview from 'components/forum/forumPreview';

export default function Forum() {

    const navigate = useNavigate();
    const params = useParams();
    const ref = useRef(null);

    const students = useSelector(state => state.lab.Students);
    const initForums = [
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 5,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user2,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user3,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user4,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]
        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 5,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user2,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user3,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user4,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 5,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 2,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 0,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user2,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 0,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user6,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 0,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user2,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]

        },
        {
            title: 'جلسه هفتگی بررسی پیشرفت دانشجویان کارشناسی',
            unreadMsg: 0,
            desc: 'لورم ایپسوم یک سری توضیحات که چی شد این تاپیک را درست کردیم',
            creationDate: 'در تاریخ 16 آذر 1402 ساخته شد',
            messages: [
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'me'
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف',
                    sender: 'امیرمهدی محمدیان',
                    avatar: user2,
                },
                {
                    content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                    sender: 'علیرضا ابراهیمی',
                    avatar: user1,
                }
            ],
            participators: [
                
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user4,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user5,
                },
                {
                    name: 'علیرضا ابراهیمی',
                    avatar: user7,
                },
            ]

        },
    ]

    const { value: msg, setValue: setMsg } = useInput('');
    const { value: forums, setValue: setForums } = useInput([]);

    const openForum = (id) => {
        navigate(`../forum/${id}`)
    }

    const sendMessage = () => {
        let data = {
            content: msg,
            sender: 'me'
        }

        let current = forums[params.id];
        current.messages = [...current.messages, data];

        setForums((prev) => {
            let newForum = [...prev];
            newForum[params.id] = current;
            return newForum;
        });
        setMsg('');
    }

    useEffect(() => {
        setForums(initForums);
    }, [])

    useEffect(() => {
        if (ref.current) ref.current.scrollTo({ top: ref.current.offsetHeight, behavior: 'smooth' });
    }, [forums])

    useEffect(() => {
        if (ref.current) ref.current.scrollTo({ top: ref.current.offsetHeight, behavior: 'smooth' });
    }, [params.id])

    
    return (
        <div className={cs(styles['container'])}>
            {
                params.id 
                    ? (
                        forums.length !== 0 && 
                            <div className={cs(styles['forum'])}> 
                                <div className={cs(styles['header'])}>
                                    <h5> {forums[params.id].title} </h5>
                                    <img 
                                        src={backArrow}
                                        alt='back icon'
                                        onClick={() => navigate(`../forum`)}
                                    />
                                </div>
                            
                                <div className={cs(styles['messages'])}> 
                                    <div className={cs(styles['messages_wrapper'])} ref={ref}> 
                                        {
                                            forums[params.id].messages && forums[params.id].messages.map((msg, i) => 
                                                msg.sender === 'me' ? (
                                                    <div className={cs(styles['message'], styles['sent_message'])} key={i}> {msg.content} </div>
                                                ) : (
                                                    <div className={cs(styles['recieved_message'])} key={i}> 
                                                        <div 
                                                            style={{backgroundImage: `url(${msg.avatar})`}} 
                                                            className={cs(styles['avatar'])}
                                                        />
                                                        <div className={cs(styles['message'], styles['content'])}>
                                                            <p> {msg.sender} </p>
                                                            <p> {msg.content} </p>
                                                        </div>
                                                    </div>
                                                )
                                            )
                                        }
                                    </div>

                                    <div className={cs(styles['chatbox'])}>
                                        <div className={cs(styles['content'])}>
                                            <textarea value={msg} onChange={(e) => setMsg(e.target.value)} placeholder={'محل وارد کردن پیام ...'}/>
                                        </div>
                                        <img 
                                            src={send}
                                            alt='send icon'
                                            onClick={() => sendMessage()}
                                        />
                                    </div>
                                </div>
                            </div>

                    ) : (
                        <div className={cs(styles['forums_container'])}>
                            <div className={cs(styles['header'])}>
                                <h5> {text.forum_title} </h5>
                                <div className={cs(styles['icons_container'])}>
                                    <img 
                                        src={addIcon}
                                        alt='add icon'
                                        // onClick={() => openAddIcon()}
                                    />
                                    <img 
                                        src={filterIcon}
                                        alt='filter icon'
                                    />
                                    <img 
                                        src={sortIcon}
                                        alt='sort icon'
                                    />
                                </div>
                            </div>
                            <div className={cs(styles['forums'])}>
                                {
                                    forums.map((f, i) => 
                                        <ForumPreview key={i} data={f} onClick={() => openForum(i)}/>
                                    )
                                }
                            </div>
                        </div>
                    )
            }
            
            <div className={cs(styles['users_list'])}>
                <h6> {text.users_title} </h6>
                {
                    students && (
                        <div className={cs(styles['users'])}>
                            {
                                students.map((student, i) => 
                                    <div className={cs(styles['user'])} key={i}>
                                        <div 
                                            style={{backgroundImage: `url(${avatar})`}} 
                                            className={cs(styles['avatar'])}
                                        />
                                        <div className={cs(styles['user_info'])}>
                                            <div className={cs(styles['top_row'])}>
                                                <p> {student.firstName}  {student.lastName}</p>
                                                <h6> {student?.type} </h6>
                                            </div>
                                            <div className={cs(styles['bottom_row'])}>
                                                <p> {'7 پیام خوانده نشده'}</p>
                                            </div>
                                        </div>
                                    </div>
                                )
                            }
                        </div>
                    )
                }
            </div>
        </div>
    )
}