export const text = {
    title: 'دسترسی های',

    item_1: 'آزمایشگاه',
    item_2: 'فوروم',
    item_3: 'رویداد',
    item_4: 'گروه',
    item_5: 'ایمیل',

    desc_1: 'دانشجو بتواند تنظیمات آزمایشگاه‌ را مشاهده کند و آن‌ها را تغییر دهد.',
    desc_2: 'دانشجو می‌تواند تمامی فوروم‌ها را مشاهده کند‌‌، حضور و غیاب انجام دهد و فوروم جدید ایجاد نماید.',
    desc_3: 'دانشجو می‌تواند به تقویم رویداد اضافه کند.',
    desc_4: 'دانشجو می‌تواند گرو‌ه‌ها را تغییر دهد.',
    desc_5: 'دانشجو می‌تواند ایمیل بفرستد و تنظیمات ایمیل را تغییر دهد.',

    button: 'ذخیره تغییرات'
}