export const text = {
    side_title: 'المان‌ها',
    side_subtitle_1: 'مایلستون',
    side_subtitle_2: 'گزارش منظم',
    side_subtitle_3: 'مطالعه مقاله',
    side_desc_1: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است',
    side_desc_2: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ',
    side_desc_3: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ',

    main_title: 'ایجاد نقشه راه برای دانشجویان',
    input_1: 'نام مسیرراه',
    input_2: 'گروه دانشجو',
    input_3: 'مقدار زمان اضافه شده',
    input_4: 'توضیحات (اختیاری)',

    error_msg: 'یک مایل استون باید حداقل یک تسک داشته باشد',
    button: 'ذخیره مسیرراه',

}