export const text = {
    side_title: 'المان‌ها',
    side_subtitle_1: 'مایلستون',
    side_subtitle_2: 'گزارش منظم',
    side_subtitle_3: 'مطالعه مقاله',
    side_desc_1: 'گام های اساسی که از دانشجو انتظار می رود در مسیر خود طی کند.',
    side_desc_2: 'گزارش منظمی که دانشجو باید در بازه های مشخص از فعالیت خود در این بازه ارائه دهد.',
    side_desc_3: 'وظیفه تحقیق و مطالعه دانشجو در یک زمینه خاص',

    main_title: 'ایجاد نقشه راه برای دانشجویان',
    input_1: 'نام نقشه راه',
    input_2: 'گروه دانشجو',
    input_3: 'مقدار زمان اضافه شده',
    input_4: 'توضیحات (اختیاری)',

    error_msg: 'یک مایل استون باید حداقل یک تسک داشته باشد',
    button: 'ذخیره نقشه راه',

}